import asyncio

import requests


def get_music_id(name):
    # 设置请求URL和参数
    url1 = "https://music.163.com/api/search/get/web"
    params1 = {
        "csrf_token": "",
        "hlpretag": "",
        "hlposttag": "",
        "s": name,
        "type": "1",
        "offset": "0",
        "total": "true",
        "limit": "1",
    }

    # 发送请求
    response = requests.get(
        url1, params=params1
    )  # await asyncio.to_thread(requests.get(url1, params=params1))

    # 检查响应状态码
    if response.status_code == 200:
        # 解析JSON数据
        data = response.json()
        data = data["result"]["songs"][0]
        # print(json.dumps(data, indent=4, ensure_ascii=False))
        song_id = data["id"]
        return song_id
    else:
        return ""


async def get_music(name):
    # 设置请求URL和参数
    url1 = "https://music.163.com/api/search/get/web"
    params1 = {
        "csrf_token": "",
        "hlpretag": "",
        "hlposttag": "",
        "s": name,
        "type": "1",
        "offset": "0",
        "total": "true",
        "limit": "1",
    }

    # 发送请求
    response = await asyncio.to_thread(requests.get(url1, params=params1))

    # 检查响应状态码
    if response.status_code == 200:
        # 解析JSON数据
        data = response.json()
        data = data["result"]["songs"][0]
        # print(json.dumps(data, indent=4, ensure_ascii=False))
        song_id = data["id"]
        song_name = data["name"]
        return song_id, song_name
    else:
        return None, None


def get_music_name(name):
    # 设置请求URL和参数
    url1 = "https://music.163.com/api/search/get/web"
    params1 = {
        "csrf_token": "",
        "hlpretag": "",
        "hlposttag": "",
        "s": name,
        "type": "1",
        "offset": "0",
        "total": "false",
        "limit": "50",
    }

    # 发送请求
    response = requests.get(url1, params=params1)

    # 检查响应状态码
    if response.status_code == 200:
        # 解析JSON数据
        data = response.json()
        # print(data)
        data = data["result"]["songs"]
        # print(json.dumps(data, indent=4, ensure_ascii=False))
        song_list = {}
        for song in data:
            if name in [artist.get("name") for artist in song["artists"]]:
                song_list[song["name"]] = song["id"]
        return song_list, len(song_list)
    else:
        return ("",)


def get_music_list():
    return [
        "コぇちっちゃ＜てゴ×ンネ",
        "Angel (feat. 可不)",
        "Aye, aye, sir!",
        "Boi",
        "CH4NGE",
        "CH4NGE (feat. 可不)",
        "Dull!! (feat.  可不)",
        "Dull!! (feat. 可不)",
        "Fallen",
        "GURU (ボカロ盤バージョン)",
        "Nosy",
        "Rabbit!?。",
        "あなたの愛した世界が見たくて",
        "あのね (feat. 可不)",
        "いっせーのーで",
        "いまいち (feat. 可不)",
        "ぅゅゅ(´；ω；｀)",
        "うらやみ しい (feat. Kai,初音ミク,可不)",
        "うらやみしい (feat. Kai,初音ミク,可不)",
        "きゅうくらりん",
        "くうになる (feat. 可不&初音ミク)",
        "このままの心で怖かった",
        "これが最後に夏だから",
        "しあわせのはこ",
        "それだけ",
        "ただ病名が欲しかった",
        "だきしめるまで。 (feat. 可不)",
        "ちょっかい問題",
        "ちょっとあざとい",
        "ねこふんじゃった。",
        "ねむれないよる (feat. 可不)",
        "はぐ (feat. 初音ミク & 可不)",
        "ひみつのユーフォー",
        "ふわり (feat. MIMI,可不,初音ミク)",
        "またおいで",
        "みんな嫌いだ、消えて。",
        "もっとかわいい",
        "ようやく君が死んだんだ。",
        "アイソトープ",
        "アイロニカルユー トピア",
        "アンチ活動中",
        "エリート",
        "オマジナイ",
        "カルト (feat. 可不)",
        "キッカイケッタイ",
        "キャットラビング",
        "キュートなカノジョ",
        "ギ フト",
        "ギフト",
        "クィホーティ",
        "コぇちっちゃ＜てゴ×ンネ",
        "サヨナラは言わないでさ (feat. 可不)",
        "シニカルディストピア",
        "ジェラシス",
        "ジブラ",
        "ストックホルムオフィス",
        "タクシィ",
        "チーズ",
        "ツキミチシルベ (feat. 初音ミク & 可不) [vocaloid ver.]",
        "ドリームイーター",
        "ナイトルール",
        "ハナタバ",
        "ハナビラ",
        "ババースデイ",
        "パイルクレイ (可不 ver.)",
        "ヒミツ (feat. 可不)",
        "プロポーズ",
        "フィオーレ (feat. 初音ミク & 可不)",
        "フォニイ",
        "マニアカル",
        "マーシャル・マキシマイザー",
        "メモリー",
        "メモリー    ー",
        "ローライト",
        "下剋上",
        "不埒な喝采",
        "九段下パンデミック。",
        "今はいいんだよ。 (feat. 可不)",
        "今日、世界が終わるのでした。 (feat. 可不)",
        "凡人",
        "化孵化",
        "可不ちゃんのカレーうどん狂騒曲",
        "天使の翼。",
        "妄想哀歌 (feat. 初音ミ   ク & 可不)",
        "妄想哀歌 (feat. 初音ミク & 可不)",
        "心を刺す言葉だけ (feat. 初音ミク & 可不)",
        "息をするだけ (feat. 可不)",
        "悲しみの雨",
        "愛し愛 (feat. 初音ミク & 可不)",
        "愛するように",
        "愛撫誘発性攻撃行動 (feat. 可不)",
        "感傷トワイライト",
        "損益分 岐点 (feat. 可不)",
        "撫でんな",
        "明るい夜",
        "明日が来るのが怖くてさ (feat. 可不)",
        "昏い夜 (feat. 吐息,v flower,可不)",
        "星界ちゃんと可不ちゃんのおつかい合騒曲",
        "朝日",
        "死にたいわけじゃなくて (feat. 可不)",
        "死んでしまったんだ",
        "流線形メーデー",
        "無理に笑わなくて良いよ",
        "生きる (feat. 可不)",
        "私のドッペルゲンガー",
        "私は、私達は",
        "空を満たして (feat. 可不)",
        "絶対敵対メチャキライヤー",
        "縛",
        "脆弱性",
        "脳裏のマキナ (feat. 可不)",
        "花となれ",
        "花火 が落ちる前に",
        "薄明の雫",
        "裏世界 (feat. 可不)",
        "酸素ソング",
        "電脳眠眠猫 (feat. 可不)",
        "食虫植物",
        "飴色の微熱",
    ]


def get_music_dict():
    return {
        "コぇちっちゃ＜てゴ×ンネ": 2634888175,
        "Angel (feat. 可不)": 1993088172,
        "Aye, aye, sir!": 2638525890,
        "Boi": 2008261020,
        "CH4NGE": 1950028990,
        "CH4NGE (feat. 可不)": 1950028990,
        "Dull!! (feat.  可不)": 2014256984,
        "Dull!! (feat. 可不)": 2014256984,
        "Fallen": 28935215,
        "GURU (ボカロ盤バージョン)": 1972350196,
        "Nosy": 2138232626,
        "Rabbit!?。": 1991045644,
        "あなたの愛した世界が見たくて": 2638034902,
        "あのね (feat. 可不)": 1969551854,
        "いっせーのーで": 1879331969,
        "いまいち (feat. 可不)": 2017145307,
        "ぅゅゅ(´；ω；｀)": 2103430407,
        "うらやみ しい (feat. Kai,初音ミク,可不)": 2129136868,
        "うらやみしい (feat. Kai,初音ミク,可不)": 2129136868,
        "きゅうくらりん": 1875436617,
        "くうになる (feat. 可不&初音ミク)": 1912598037,
        "このままの心で怖かった": 2151646203,
        "これが最後に夏 だから": 2638037327,
        "しあわせのはこ": 2101412302,
        "それだけ": 2620017424,
        "ただ病名が欲しかった": 2084397982,
        "だきしめるまで。 (feat. 可不)": 1917999677,
        "ちょっかい問題": 2067572658,
        "ちょっとあざとい": 1871751442,
        "ねこふんじゃった。": 2074417425,
        "ねむれないよる (feat. 可不)": 2625456240,
        "はぐ (feat. 初音ミク & 可不)": 2097828677,
        "ひみつのユーフォー": 1870563237,
        "ふわり (feat. MIMI,可不,初音ミク)": 2034848078,
        "またおいで": 2635812056,
        "みんな嫌いだ、消えて。": 2637054771,
        "もっとかわいい": 1957290730,
        " ようやく君が死んだんだ。": 1968613039,
        "アイソトープ": 2141345581,
        "アイロニカルユー トピア": 1935648709,
        "アンチ活動中": 2639749210,
        "エリート": 2139362850,
        "オマジナイ": 2084311527,
        "カルト (feat. 可不)": 2636997854,
        "キッカイケッタイ": 1979045976,
        "ギフト": 2149523329,
        "サヨナラは言わないでさ (feat. 可不)": 2057648979,
        "ジェラシス": 1867931739,
        "ジブラ": 1982784816,
        "タクシィ": 2122655412,
        "ツキミチシルベ (feat. 初音ミク & 可不) [vocaloid ver.]": 2148168729,
        "ドリームイーター": 2003904108,
        "ナイトルール": 1914692622,
        "ハナビラ": 2144758550,
        "ババースデイ": 2097515349,
        "パイルクレイ (可不 ver.)": 2629500638,
        "ヒミツ (feat. 可不)": 1961784984,
        "プロポーズ": 2071866065,
        "マニアカル": 2639634944,
        "メモリー    ー": 2095851244,
        "下剋上": 2091876015,
        "不埒な喝采": 1867928484,
        "今はいいんだよ。 (feat. 可不)": 2008735702,
        "今日、世界が終わるのでした。 (feat. 可不)": 2637791865,
        "凡人": 1465290469,
        "化孵化": 2058263033,
        "可不ちゃんのカレーうどん狂騒曲": 2099352526,
        "天使の翼。": 2006511504,
        "妄想哀歌 (feat. 初音ミク & 可 不)": 2054974200,
        "心を刺す言葉だけ (feat. 初音ミク & 可不)": 2091770490,
        "息をするだけ (feat. 可不)": 2066426135,
        "悲しみの雨": 533455758,
        "愛するように": 2127734560,
        "損益分 岐点 (feat. 可不)": 2636669090,
        "撫でんな": 1941555670,
        "明るい夜": 2624045024,
        "明日が来るのが怖くてさ (feat. 可不)": 2135100197,
        "昏い夜 (feat. 吐息,v flower,可不)": 2052146908,
        "星界ちゃんと可不ちゃんのおつかい合騒曲": 2091673318,
        "死にたいわけじゃなくて (feat. 可不)": 2069326520,
        "流線形メーデー": 1963685523,
        "無理に笑わなくて良いよ": 1922287635,
        "生きる (feat. 可不)": 1862516716,
        "私のドッペルゲンガー": 2042620663,
        "絶対敵対メチャキライヤー": 1941347910,
        "縛": 1989151258,
        "脆弱性": 2059789820,
        "脳裏のマキナ (feat. 可不)": 1904183194,
        "花となれ": 1867931740,
        "花火 が落ちる前に": 2620449634,
        "薄明の雫": 2638086615,
        "食虫植物": 1867921493,
        "飴色の微熱": 1959409924,
        "これが最後に夏だから": 2638037327,
        "ようやく君が死んだんだ。": 1968613039,
        "キャットラビング": 2042620725,
        "キュートなカノジョ": 2617560634,
        "クィホーティ": 1959715041,
        "シニカルディ ストピア": 1922810292,
        "チーズ": 2139361218,
        "ハナタバ": 1999253939,
        "フィオーレ (feat. 初音ミク & 可不)": 2077050077,
        "マーシャル・マキシマイザー": 1900171627,
        "メモリー": 2095851244,
        "妄想哀歌 (feat. 初音ミク & 可不)": 2054974200,
        "愛し愛 (feat. 初音ミク           & 可不)": 2117567658,
        "愛撫誘発性攻撃行動 (feat. 可不)": 1998983149,
        "感傷トワイライト": 512376195,
        "朝日": 1867928486,
        "死んでしまったんだ": 1944863562,
        "私は、私達は": 2026535564,
        "裏世界 (feat. 可不)": 2154502893,
        "酸素ソング": 2634843775,
        "ストッ ク ホ ルムオフィス": 2080019955,
        "フォニイ": 1900172235,
        "ローライト": 2633908595,
        "妄想哀歌 (feat. 初音ミ   ク & 可不)": 2054974200,
        "空を満たして (feat. 可不)": 1956553544,
        "電脳眠眠猫 (feat. 可不)": 2146644042,
        "九段下パンデミック。": 2637083552,
        "シニカルデ ィストピア": 1922810292,
        "ストックホルムオフィス": 2080019955,
        "愛し愛 (feat. 初音ミク & 可不)": 2117567658,
        "ギ フト": 2149523329,
        "シニカルディストピア": 1922810292,
    }


if __name__ == "__main__":
    for i in list(
        {
            "異星にいこうね (feat. 星界)": 2012668595,
            "ただ病名が欲しかった": 2084397982,
            "メモリー": 2095851244,
            "Clover (feat. 音楽的同位体 星界)": 2612729216,
            "星界ちゃんと可不ちゃんのおつかい合騒曲": 2091673318,
            "ハナビラ": 2144758550,
            "しあわせのはこ": 2101412302,
            "カレンの清掃": 2600429501,
            "背水、偶像神話": 2648829611,
            "月": 2042004060,
            "侵蝕": 2042004074,
            "エリカの憂い feat. 星界": 1971652189,
            "ネ　土　会　ェ　貝　南　犬　☆　カ　ゞ　ん　I　よ　″　る　ノ　D　A　!!｡ feat. ずんだもん": 2149046007,
            "お行儀よくね": 2042008748,
            "傀儡阿修羅": 2042004070,
            "権利買取済少女": 2042004051,
            "しあわせ": 2042008734,
            " エリカの憂い - ヰ世界情緒 feat. 星界": 2060099995,
            "エリカの憂い": 2042008747,
            "シェイク": 2600429498,
            "花の名残り": 2634887468,
            "とこしずめ": 2042008746,
            "異星にいこうね - ヰ世界情緒 feat. 星界": 2061025382,
            "しあわせ - ヰ世界情緒 feat. 星界": 2061687695,
            "欠陥照明": 2600428579,
            "ふたりの方法": 2042008731,
            "ガオウ": 2615100365,
            "えすけーぷ": 2042004053,
            "Keep going": 2629522998,
            "お行儀よくね - ヰ世界情緒 feat. 星界": 2061025379,
            "えすけーぷ (feat. 星界)": 1950888680,
            "いらない、いらない、いらない。": 2042008729,
            "裏命ちゃんのフクオカトリップ奇騒曲": 2132303518,
            "ステラの座": 2042004069,
            "ぜろぐらむ": 2600428574,
            "異星にいこうね": 2042008728,
            "とこしずめ /covered by ヰ世 界情緒": 2008994161,
            "わたしいまめまいしたわ": 2042004049,
            "メルヘンを殺さないで": 2042008749,
            "アトマリアの祈り": 2004882321,
            "ドールジアビス": 2042004052,
            "遠心力": 2042004050,
            "アイオーンの女神": 2600428578,
            "太陽ポカポカで 草": 2626705460,
            "ジキル (feat. 音楽的同位体 星界)": 2615819335,
            "セカイセイフク": 2042004054,
            "グレートフィルター": 2042008727,
            "羨望、頂に明星": 2042008732,
            "売れない本の主人公たちへ": 2042004061,
        }.keys()
    ):
        print(i + "\\n", end="")
